slides/Project2-Deliverables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project2-Deliverables</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Project2-Deliverables"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-06T01:55-0800"/>
<meta name="author" content="Jim Blomo"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Project2-Deliverables</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Project 2 Deliverables</a>
<ul>
<li><a href="#sec-1-1">1.1 How to</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Technical Report</a>
<ul>
<li><a href="#sec-2-1">2.1 Heuristic</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Code</a>
<ul>
<li><a href="#sec-3-1">3.1 Quality</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Presentation</a>
<ul>
<li><a href="#sec-4-1">4.1 Depends</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Questions?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project 2 Deliverables &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>Midnight of the 12th
</li>
<li>Technical Report (<a href="https://piazza.com/class/hkxejwsmf0z2fe?cid=112">Piazza</a>)
</li>
<li>Code
</li>
<li>Slides
</li>
<li>GitHub Pull Request
</li>
</ul>


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> How to &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>Pull request should have everything.
</li>
<li>PDF or Tech report
</li>
<li>PDF/PPT of slides
</li>
<li>Presentation may be mostly demo, that's fine. Don't do many slides
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Technical Report &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Intro
</li>
<li>~1 page / feature
</li>
<li>Problem, example, technology, challeneges, alternatives, future
</li>
</ul>


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Heuristic &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">

<ul>
<li>I should have a good start re-implementing your features
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Code &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Ideally will be runnable on ISchool
</li>
<li>Advanced work, please use <code>virtualenv</code> with <code>requirements.txt</code>
</li>
<li>If its not implemented, no credit
</li>
<li>User facing quality is evaluated
</li>
</ul>


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Quality &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>Not just "pretty" but functional and using the ideas we talked about in
     class
</li>
<li>Semantic markup, CSS for style, REST where appropriate
</li>
<li>Corner cases, validation, security
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Presentation &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>Very fast! 10 minutes max
</li>
<li>Try out the projector before/after class, spare
</li>
<li>Live demos strongly encouraged, backup
</li>
</ul>


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Depends &nbsp;&nbsp;&nbsp;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-4-1">

<ul>
<li>Will depends on how many submissions I get
</li>
<li>Will go in alphabetical order of last name
</li>
<li>Make people interested in your technical report: "Whoa, how did you do
     that?"
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Questions? &nbsp;&nbsp;&nbsp;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">





<script type="text/javascript" src="production/org-html-slideshow.js"></script>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-12-06T01:55-0800</p>
<p class="author">Author: Jim Blomo</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.2 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
